Tekla Open API Reference for Tekla Structures 2025
Phase.GetUserProperty Method
Overload List
Name | Description
GetUserProperty(String, Double)
 Retrieves a double property for the phase.
GetUserProperty(String, Int32)
 Retrieves an integer property for the phase.
GetUserProperty(String, String)
 Retrieves a string property for the phase.
Top
See Also
Reference
Phase Class
Tekla.Structures.Model Namespace